Repository: skitoo/python-guide
Catalog: docs/_locale/*/LC_MESSAGES/index.po
Languages: fr

source: The Hitchhiker's Guide to Python!
fr: Le Guide du Routard pour Python !

source: Welcome to The Hitchhiker's Guide to Python. `DON'T PANIC! <http://www.amazon.com/gp/product/B0043M4ZH0/ref=as_li_ss_tl?ie=UTF8&tag=bookforkind-20&linkCode=as2&camp=1789&creative=390957&creativeASIN=B0043M4ZH0>`_
fr: Bienvenue dans Le Guide du Routard pour Python. `PAS DE PANIQUE ! <http://www.amazon.com/gp/product/B0043M4ZH0/ref=as_li_ss_tl?ie=UTF8&tag=bookforkind-20&linkCode=as2&camp=1789&creative=390957&creativeASIN=B0043M4ZH0>`_

source: **This guide is currently under heavy development, and is mostly a skeleton at the moment.** If you'd like to help, `fork us on GitHub <https://github.com/kennethreitz/python-guide>`_!
fr: **Ce guide est actuellement en cours de développement, c'est une ébauche pour le moment.** Si vous souhaitez nous aider, `faites un fork depuis GitHub <https://github.com/kennethreitz/python-guide>`_ !

source: This *opinionated* guide exists to provide both novice and expert Python developers a best-practice handbook to the installation, configuration, and usage of Python on a daily basis.
fr: Ce guide *dogmatique* existe pour fournir aux novices ainsi qu'aux experts Python un manuel de bonnes pratiques pour l'installation, la configuration et l'utilisation de Python au quotidien.

source: Getting Started
fr: Mise en route

source: This part of the guide focuses on setting up your Python environment.
fr: Cette partie du guide se concentre sur l'installation de votre environnement Python.

source: Properly Install Python
fr: Installer correctement Python

source: Writing Great Code
fr: Écrire du super code

source: This part of the guide focuses on best practices for writing Python code.
fr: Cette partie du guide se concentre sur les meilleures pratiques pour écrire du code Python.

source: Scenario Guide
fr: Guide de scénario

source: This part of the guide focuses on tool and module advice based on different scenarios.
fr: Cette partie du guide vous conseille sur des outils et des modules basés sur différents scénarios.

source: Shipping Great Code
fr: Diffuser du super code

source: This part of the guide focuses on deploying your Python code.
fr: La partie de ce guide se concentre sur le déploiement de votre code Python.

source: Development Environment
fr: Environnement de développement

source: Additional Notes
fr: Notes complémentaires

source: This part of the guide, which is mostly prose, begins with some background information about Python, then focuses on next steps.
fr: Cette partie du guide commence par quelques informations de fond sur Python, puis sur les étapes suivantes.

source: Contibution notes and legal information are here (for those interested).
fr: Les notes de contribution et les informations légales sont ici (pour ceux qui sont intéressés).
